<?php
//Объявить массив, индексами которого являются буквы русского языка,
// а значениями – соответствующие латинские буквосочетания
// (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
//Написать функцию транслитерации строк.

function translit($text)
{

    $arrChar = array(

        "а" => "a", "б" => "b", "в" => "v", "г" => "g",
        "д" => "d", "е" => "e", "ё" => "e", "ж" => "zh",
        "з" => "z", "и" => "i", "й" => "i", "к" => "k",
        "л" => "l", "м" => "m", "н" => "n", "о" => "o",
        "п" => "p", "р" => "r", "с" => "s", "т" => "t",
        'у' => "u", "ф" => "f", "х" => "kh", "ц" => "tc",
        "ч" => "ch", "ш" => "sh", "щ" => "shch", "ы" => "y",
        "э" => "e", "ю" => "iu", "я" => "ia", "ь" => ""
    );

    foreach ($arrChar as $key => $val) {
        $text = str_ireplace($key, $val, $text);
    }
    return $text;
}

echo translit("у лукоморья дуб зеленый!");



